DROP DATABASE IF EXISTS bf;
CREATE DATABASE bf;
USE bf;

DROP TABLE IF EXISTS `user`;

CREATE TABLE `user` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  `psd` varchar(255) NOT NULL,
  `authority` int NOT NULL DEFAULT '1',
  `logcnt` int DEFAULT '1',
  `birthday` varchar(255) DEFAULT NULL,
  `city` varchar(255) DEFAULT NULL,
  `gender` varchar(255) DEFAULT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=10 DEFAULT CHARSET=utf8mb3;

/*Data for the table `user` */

insert  into `user`(`id`,`name`,`psd`,`authority`,`logcnt`,`birthday`,`city`,`gender`) values 
(1,'admin','123456',0,14,NULL,NULL,NULL),
(2,'gm','gm',1,1,NULL,NULL,NULL),
(3,'最帅制作人','zszzr',-1,1,NULL,NULL,NULL),
(4,'ffgz','ffgz',-1,1,NULL,NULL,NULL),
(5,'无敌大魔王','wddmw',1,1,NULL,NULL,NULL),
(6,'susy','susya',1,1,'1999-12-31','贺州','femal'),
(7,'ally','allya',1,1,'1700-09--1','newyork','man'),
(8,'allysmith','allya',1,1,'1703-09--1','newyork','woman'),
(9,'fork','fffooorrrkkk',1,1,'1999-11-02','HeZhou','man');


DROP TABLE IF EXISTS `msg`;

CREATE TABLE `msg` (
  `id` int NOT NULL AUTO_INCREMENT,
  `content` varchar(255) NOT NULL,
  `date` varchar(50) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=61 DEFAULT CHARSET=utf8mb3;

/*Data for the table `msg` */

insert  into `msg`(`id`,`content`,`date`) values 
(1,'加油！！！奥利给！！！','05/29 19:41'),
(2,'加油！！！','05/29 19:42'),
(3,'所以 Saber 都不是人来玩了，全是机器？！','05/29 19:50'),
(4,'今晚上彻底搞完毕设','05/29 19:59'),
(5,'生而为人我很抱歉','05/29 20:41'),
(6,'芜湖','05/30 20:41'),
(7,'好难好难！！！！','05/30 20:43'),
(8,'两片面包夹范斯！','05/30 20:45'),
(9,'图论， 船新的算法，带你体验抽象的数据结构，解决不可能想到实际上可以解决但思维跳跃极大的问题<(￣︶','05/30 20:45'),
(10,'蓝桥杯国赛，加油！！！','05/30 20:46'),
(11,'跪求手机APP','05/30 20:47'),
(12,'又遇见素质不高骂别人素质不高的了','05/31 20:48'),
(13,'发多少个法国岁的法国梵蒂冈的梵蒂冈的方法','05/31 20:49'),
(14,'沙发','05/31 20:50'),
(15,'大郎说他饿了','05/31 20:01'),
(16,'大郎说他渴了','05/31 20:03'),
(17,'加油！！！','05/31 20:04'),
(18,'加油！！！','05/31 20:07'),
(19,'阿打算','19:56:12'),
(20,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:23'),
(21,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:23'),
(22,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:24'),
(23,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:24'),
(24,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:30'),
(25,'全新算法','2021-06-03 19:57:41'),
(26,'你好啊 ','2021-06-03 19:58:34'),
(27,'苏安然我 ','2021-06-03 19:58:39'),
(28,'我啥都不想说了 真的 ','2021-06-03 20:02:32'),
(29,'我啥都不想说了 真的的  ','2021-06-03 20:28:06'),
(30,' 我啥都不想说了 真的  ','2021-06-03 20:28:09'),
(31,'加油！！！奥利给！！！','05/29 19:41'),
(32,'加油！！！','05/29 19:42'),
(33,'所以 Saber 都不是人来玩了，全是机器？！','05/29 19:50'),
(34,'今晚上彻底搞完毕设','05/29 19:59'),
(35,'生而为人我很抱歉','05/29 20:41'),
(36,'芜湖','05/30 20:41'),
(37,'好难好难！！！！','05/30 20:43'),
(38,'两片面包夹范斯！','05/30 20:45'),
(39,'图论， 船新的算法，带你体验抽象的数据结构，解决不可能想到实际上可以解决但思维跳跃极大的问题<(￣︶','05/30 20:45'),
(40,'蓝桥杯国赛，加油！！！','05/30 20:46'),
(41,'跪求手机APP','05/30 20:47'),
(42,'又遇见素质不高骂别人素质不高的了','05/31 20:48'),
(43,'发多少个法国岁的法国梵蒂冈的梵蒂冈的方法','05/31 20:49'),
(44,'沙发','05/31 20:50'),
(45,'大郎说他饿了','05/31 20:01'),
(46,'大郎说他渴了','05/31 20:03'),
(47,'加油！！！','05/31 20:04'),
(48,'加油！！！','05/31 20:07'),
(49,'阿打算','19:56:12'),
(50,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:23'),
(51,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:23'),
(52,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:24'),
(53,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:24'),
(54,'额鹅鹅鹅  你想说啥','2021-06-03 19:57:30'),
(55,'全新算法','2021-06-03 19:57:41'),
(56,'你好啊 ','2021-06-03 19:58:34'),
(57,'苏安然我 ','2021-06-03 19:58:39'),
(58,'我啥都不想说了 真的 ','2021-06-03 20:02:32'),
(59,'我啥都不想说了 真的的  ','2021-06-03 20:28:06'),
(60,' 我啥都不想说了 真的  ','2021-06-03 20:28:09');


DROP TABLE IF EXISTS `category`;

CREATE TABLE `category` (
  `id` int NOT NULL AUTO_INCREMENT,
  `name` varchar(255) NOT NULL,
  PRIMARY KEY (`id`),
  UNIQUE KEY `name` (`name`)
) ENGINE=InnoDB AUTO_INCREMENT=11 DEFAULT CHARSET=utf8mb3;

/*Data for the table `category` */

insert  into `category`(`id`,`name`) values 
(1,'亲自家教'),
(2,'哲学理论'),
(3,'小说'),
(4,'投资理财'),
(5,'政治军事'),
(6,'现代随笔'),
(7,'社会科学'),
(8,'科普百科'),
(9,'经济管理'),
(10,'青春文学');
